package by.academy.HW2.task2;

public class Main {
    public static void main(String[] args) {
        Number odd = new Number();
        int[] twoOne = {20,1,-1,2,-2,3,3,5,5,1,2,4,20,4,-1,-2,5};
        int[] twoTwo = {1,1,2,-2,5,2,4,4,-1,-2,5};
        int[] twoThree = {20,1,1,2,2,3,3,5,5,4,20,4,5};
        int[] twoFour = {10};
        int[] twoFive = {1,1,1,1,1,1,10,1,1,1,1};
        int[] twoSix = {5,4,3,2,1,5,4,3,2,10,10};

        odd.sort(twoOne);
        odd.sort(twoTwo);
        odd.sort(twoThree);
        odd.sort(twoFour);
        odd.sort(twoFive);
        odd.sort(twoSix);







    //    По заданному массиву найдите число, которое встречается нечетное количество раз
    //    (Всегда будет только одно число, которое встречается нечетное количество раз):
    //    2.1. {20,1,-1,2,-2,3,3,5,5,1,2,4,20,4,-1,-2,5};
    //    2.2. {1,1,2,-2,5,2,4,4,-1,-2,5};
    //    2.3. {20,1,1,2,2,3,3,5,5,4,20,4,5};
    //    2.4. {10};
    //    2.5. {1,1,1,1,1,1,10,1,1,1,1};
    //    2.6. {5,4,3,2,1,5,4,3,2,10,10};

    }
}
